app/controllers/movies_controller.rb

  def similar
    id = params[:id]
    @movie = Movie.find(id)
    director = @movie.director
    if director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director(@movie.director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ''